research/visualization_methods/outputs/RTS vs BIFM Smoothing__BIFM_smoother/BIFM_smoother.dot
digraph G {
  "A" [label="A"];
  "BIFM" [label="BIFM"];
  "BIFMHelper" [label="BIFMHelper"];
  "MvNormal" [label="MvNormal"];
  "Wu" [label="Wu"];
  "Wy" [label="Wy"];
  "dim_lat" [label="dim_lat"];
  "i" [label="i"];
  "mean" [label="mean"];
  "precision" [label="precision"];
  "size" [label="size"];
  "u" [label="u"];
  "y" [label="y"];
  "yt" [label="yt"];
  "z" [label="z"];
  "z_prior" [label="z_prior"];
  "μu" [label="μu"];
  "A" -> "dim_lat";
  "BIFM" -> "yt";
  "BIFMHelper" -> "z";
  "MvNormal" -> "u";
  "MvNormal" -> "y";
  "MvNormal" -> "z_prior";
  "Wu" -> "u";
  "Wy" -> "y";
  "i" -> "y";
  "i" -> "yt";
  "mean" -> "u";
  "mean" -> "y";
  "mean" -> "z_prior";
  "precision" -> "u";
  "precision" -> "y";
  "precision" -> "z_prior";
  "size" -> "dim_lat";
  "u" -> "yt";
  "yt" -> "y";
  "z" -> "yt";
  "z_prior" -> "z";
  "μu" -> "u";
}
